In [ ]:
create a 3 pandas dataframe and merge them with concat method.

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'col1':[11,112,13], 'col2': [21,122,23]})
df2 = pd.DataFrame({'col1':[111,112,113], 'col2': [121,122,123]})
df3 = pd.DataFrame({'col1':[211,212,213], 'col2': [221,222,223]})

In [3]:
df1

   col1  col2
0    11    21
1   112   122
2    13    23

In [4]:
df2

   col1  col2
0   111   121
1   112   122
2   113   123

In [5]:
df3

   col1  col2
0   211   221
1   212   222
2   213   223

In [7]:
pd.concat((df1,df2,df3))

   col1  col2
0    11    21
1   112   122
2    13    23
0   111   121
1   112   122
2   113   123
0   211   221
1   212   222
2   213   223

In [8]:
pd.concat((df1,df2,df3), ignore_index=True, axis=1)

     0    1    2    3    4    5
0   11   21  111  121  211  221
1  112  122  112  122  212  222
2   13   23  113  123  213  223